{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces",
      "apiVersion": "2020-08-01",
      "name": "myWorkspace",
      "location": "East US",
      "properties": {
        "sku": {
          "name": "PerGB2018"
        }
      }
    },
    {
      "type": "Microsoft.SecurityInsights/alertRules",
      "apiVersion": "2021-10-01",
      "name": "myAlertRule",
      "dependsOn": [
        "[resourceId('Microsoft.OperationalInsights/workspaces', 'myWorkspace')]"
      ],
      "properties": {
        "enabled": true,
        "query": "SecurityEvent | where TimeGenerated > ago(1d)",
        "queryFrequency": "PT1H",
        "queryPeriod": "P1D",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "severity": "Medium",
        "suppressionDuration": "PT1H",
        "suppressionEnabled": false,
        "actions": [],
        "displayName": "My Alert Rule",
        "description": "An example alert rule",
        "tactics": ["InitialAccess"]
      }
    }
  ]
}
